{
  "descripcion": "La pantalla de Colaboradores te permite ver, buscar, agregar y editar a todas las personas que trabajan con tu empresa, como choferes y encargados. Es una tabla clara y fácil de usar, donde podés filtrar, exportar y personalizar las columnas que ves.",
  "como_llegar": [
    "Hacé clic en el ícono de 'Colaboradores' (el de las personas) en la barra lateral izquierda.",
    "Entrás directo a la lista de colaboradores, donde podés ver y gestionar toda la información relevante."
  ],
  "elementos_principales": {
    "Panel superior": [
      "Título grande 'Colaboradores' arriba a la izquierda.",
      "Buscador para filtrar por nombre, apellido, CUIL, etc.",
      "Botón '+ AGREGAR COLABORADOR' arriba a la derecha para crear uno nuevo.",
      "Botón 'FILTROS' para aplicar filtros avanzados.",
      "Botón 'EXPORTAR' para descargar la lista (por ejemplo, en Excel).",
      "Botón 'COLUMNAS' para elegir qué columnas mostrar en la tabla."
    ],
    "Tabla de colaboradores": [
      "Cada fila es un colaborador y cada columna muestra un dato: Cuil, Nombre, Número Celular, Apellido, URL Linti, Localidad, Cuit Empresas, Rol, Editar.",
      "Columna 'Editar' con ícono de lápiz para modificar los datos del colaborador.",
      "Columna 'Rol' muestra si es Chofer, Encargado, etc. Esto puede afectar qué acciones puede hacer cada uno en el sistema."
    ],
    "Paginación": [
      "Abajo a la derecha, podés elegir cuántas filas ver por página y navegar entre páginas si hay muchos colaboradores."
    ]
  },
  "acciones_principales": [
    {
      "nombre": "Agregar colaborador",
      "descripcion": "Hacé clic en '+ AGREGAR COLABORADOR', completá los datos obligatorios (nombre, apellido, CUIL, empresa, etc.) y guardá. Si el CUIL ya existe, el sistema te avisa y no deja guardar."
    },
    {
      "nombre": "Editar colaborador",
      "descripcion": "En la columna 'Editar', hacé clic en el lápiz. Se abre el formulario con los datos ya cargados. Modificá lo que necesites y guardá los cambios."
    },
    {
      "nombre": "Eliminar colaborador",
      "descripcion": "Si tu rol lo permite, podés eliminar un colaborador desde el formulario de edición o desde la tabla (ícono de basurita). El sistema pide confirmación antes de borrar."
    },
    {
      "nombre": "Buscar colaborador",
      "descripcion": "Usá el buscador para filtrar rápidamente por nombre, apellido, CUIL, etc. La tabla se actualiza al instante."
    },
    {
      "nombre": "Filtrar y exportar",
      "descripcion": "Aplicá filtros avanzados con el botón 'FILTROS' o exportá la lista con 'EXPORTAR'."
    },
    {
      "nombre": "Personalizar columnas",
      "descripcion": "Con el botón 'COLUMNAS' elegís qué datos ver en la tabla, según lo que te resulte más útil."
    }
  ],
  "preguntas_frecuentes": [
    {
      "pregunta": "¿Qué significa 'URL Linti'?",
      "respuesta": "Es el enlace al perfil del colaborador en el sistema LINTI, que es el registro nacional para choferes de transporte interjurisdiccional."
    },
    {
      "pregunta": "¿Por qué no puedo editar o eliminar un colaborador?",
      "respuesta": "Probablemente tu rol no tiene permiso para esa acción. Si necesitás hacerlo, contactá a un administrador."
    },
    {
      "pregunta": "¿Qué pasa si ingreso un CUIL que ya existe?",
      "respuesta": "El sistema no permite duplicados. Si el CUIL ya está registrado, no vas a poder guardar el colaborador nuevo."
    }
  ],
  "consejos_utiles": [
    "Mantené los datos de tus colaboradores actualizados, sobre todo el número de celular y la empresa asociada.",
    "Si necesitás agregar un tipo de colaborador que no aparece, pedile ayuda a un administrador.",
    "Usá los filtros y la búsqueda para encontrar rápido a quien necesitás, sobre todo si tenés muchos colaboradores.",
    "Solo los roles con permiso pueden crear, editar o borrar colaboradores. Si no ves la opción, consultá la sección de permisos."
  ]
} 